books.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-09-22 Mo 13:32 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>uni uni uni blog blog blog</title>
<meta name="author" content="Uni Marx" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">uni uni uni blog blog blog</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org95bb666">1. things i read this year</a>
<ul>
<li><a href="#orgc287130">1.1. Draußen vor der Tür</a></li>
<li><a href="#org740d5d4">1.2. Wackelkontakt</a></li>
<li><a href="#org10ad071">1.3. Tractatus logico-philosophicus</a></li>
<li><a href="#org4e0c64b">1.4. Gratis-Prophezeiungen</a></li>
<li><a href="#org7865e2b">1.5. Identity and Necessity</a></li>
<li><a href="#org6439dc1">1.6. Die Diversität der Ausbeutung</a></li>
<li><a href="#org46cf782">1.7. Escrache - Aktionen nichtstaatlicher Gerechtigkeit in Argentinien</a></li>
<li><a href="#orga4af816">1.8. Queer-feministische Positionen</a></li>
<li><a href="#org744ff94">1.9. Verkehrungen ins Gegenteil</a></li>
<li><a href="#orgec353a0">1.10. Heimkehr nach Björndal/Ingen vei går utenom</a></li>
<li><a href="#org4bf5f2a">1.11. Transkript</a></li>
<li><a href="#orgc8092b3">1.12. Siddhartha</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-org95bb666" class="outline-2 ">
<h2 id="org95bb666" class=""><span class="section-number-2">1.</span> things i read this year</h2>
<div class="outline-text-2" id="text-1">
<p>
mostly german but i&rsquo;ll talk about it in english anyways, vaguely in order. of course theres plenty more stuff in mathematics too and so on but its not the same kind of reading at all, so its hard to count
</p>
</div>
<div id="outline-container-orgc287130" class="outline-3 ">
<h3 id="orgc287130" class=""><span class="section-number-3">1.1.</span> Draußen vor der Tür</h3>
<div class="outline-text-3" id="text-1-1">
<p>
(Wolfgang Borchert, 1947)
</p>

<p>
heavy post-WW2 drama about reintegration, war, morality and guilt. worth a read though a very german perspective that one should not necessarily fuck with
</p>
</div>
</div>
<div id="outline-container-org740d5d4" class="outline-3 ">
<h3 id="org740d5d4" class=""><span class="section-number-3">1.2.</span> Wackelkontakt</h3>
<div class="outline-text-3" id="text-1-2">
<p>
(Wolf Haas, 2025)
</p>

<p>
Escherian &ldquo;braided&rdquo; novel with two interacting plots of crime and personal drama (though its not a detective novel or anything) each containing the other as a piece of in-universe fiction. very well executed, humorous but not too light, good read for a hospital stay
</p>
</div>
</div>
<div id="outline-container-org10ad071" class="outline-3 ">
<h3 id="org10ad071" class=""><span class="section-number-3">1.3.</span> Tractatus logico-philosophicus</h3>
<div class="outline-text-3" id="text-1-3">
<p>
(Ludwig Wittgenstein, 1922)
</p>

<p>
he applies some decent analysis from my unknowing point of view but some of his views about, say, equality, are a bit bizarre and were revised at some point from what i remember. in particular the whole conclusions about philosophy are rather strange to me
</p>
</div>
</div>
<div id="outline-container-org4e0c64b" class="outline-3 ">
<h3 id="org4e0c64b" class=""><span class="section-number-3">1.4.</span> Gratis-Prophezeiungen</h3>
<div class="outline-text-3" id="text-1-4">
<p>
(Umberto Eco, 2003)
</p>

<p>
collection of newspaper columns about societal changes in the new millenium. some of them turned out rather accurate some i found a bit obnoxious idk i honestly dont remember much
</p>
</div>
</div>
<div id="outline-container-org7865e2b" class="outline-3 ">
<h3 id="org7865e2b" class=""><span class="section-number-3">1.5.</span> Identity and Necessity</h3>
<div class="outline-text-3" id="text-1-5">
<p>
(Saul Kripke, 1971)
</p>

<p>
lecture notes on contingency vs necessity, a priori vs a posteriori identity judgements leading to a refutation of a particular theory of consciousness. surprisingly accessible and worth a read, enjoyed it a lot
</p>
</div>
</div>
<div id="outline-container-org6439dc1" class="outline-3 ">
<h3 id="org6439dc1" class=""><span class="section-number-3">1.6.</span> Die Diversität der Ausbeutung</h3>
<div class="outline-text-3" id="text-1-6">
<p>
(Eleonora Roldán Mendívil &amp; Bafta Sarbo et al, 2023)
</p>

<p>
Marxist perspectives on racism in contemporary germany as well as coloniality, gender relations, etc. each essay is a great read, highly acclaimed and rightfully so. if you speak german read this
</p>
</div>
</div>
<div id="outline-container-org46cf782" class="outline-3 ">
<h3 id="org46cf782" class=""><span class="section-number-3">1.7.</span> Escrache - Aktionen nichtstaatlicher Gerechtigkeit in Argentinien</h3>
<div class="outline-text-3" id="text-1-7">
<p>
(Colectivo Situationes, 2004)
</p>

<p>
the <i>escrache</i> were (are? unclear) a surprisingly successful movement and type of protest in argentina to identify, and (not a bad thing!) harass officials of the junta a solid 20 years after the fact. this book contains reflections and dialogues about their aims and methods as well as the new political dynamics this yielded. i have no idea whether theres a spanish original or english translation but i gained a lot from reading this both with regards to argentina in particular and political tactics in general
</p>
</div>
</div>
<div id="outline-container-orga4af816" class="outline-3 ">
<h3 id="orga4af816" class=""><span class="section-number-3">1.8.</span> Queer-feministische Positionen</h3>
<div class="outline-text-3" id="text-1-8">
<p>
(Verónica Orsi et al, 2024)
</p>

<p>
Latin american feminist perspectives from diaspora in german speaking countries. some intriguing essays and short stories here and there, though not quite as interesting as i expected it to be idk
</p>
</div>
</div>
<div id="outline-container-org744ff94" class="outline-3 ">
<h3 id="org744ff94" class=""><span class="section-number-3">1.9.</span> Verkehrungen ins Gegenteil</h3>
<div class="outline-text-3" id="text-1-9">
<p>
(Sylvia Sasse, 2023)
weird liberal analysis on inversion of concepts as a tool to exercise power. has a few interesting aspects especially wrt nietzsche but does overall not seem particularly enlightening to me
</p>
</div>
</div>
<div id="outline-container-orgec353a0" class="outline-3 ">
<h3 id="orgec353a0" class=""><span class="section-number-3">1.10.</span> Heimkehr nach Björndal/Ingen vei går utenom</h3>
<div class="outline-text-3" id="text-1-10">
<p>
(Trygve Gulbranssen, 1930s?)
novella on a norwegian lumberjack at the end of his life, scared of returning to the place he came from. about receiving kindness where do you not expect it, and what it takes to seek it out. wasnt aware this was part of a trilogy though. generally nice
</p>
</div>
</div>
<div id="outline-container-org4bf5f2a" class="outline-3 ">
<h3 id="org4bf5f2a" class=""><span class="section-number-3">1.11.</span> Transkript</h3>
<div class="outline-text-3" id="text-1-11">
<p>
(Benjamin von Stuckrad-Barre, 2017)
protocols of the rather bizarre readings of the author&rsquo;s previous works. fun!
</p>
</div>
</div>
<div id="outline-container-orgc8092b3" class="outline-3 ">
<h3 id="orgc8092b3" class=""><span class="section-number-3">1.12.</span> Siddhartha</h3>
<div class="outline-text-3" id="text-1-12">
<p>
(Hermann Hesse, 1922)
quite astounding in its beauty. not sure what to say really
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Uni Marx</p>
<p class="date">Created: 2025-09-22 Mo 13:32</p>
</div>
</body>
</html>
